# IsValid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Color..::..IsValid Property
Color Class See Also
---
Identifies if the color represents a valid color, or an uninitialized/invalid value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsValid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsValid As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsValid {
	bool get ();
}
```

# See Also
Color Class
Autodesk.Revit.DB Namespace